In [1]:
try:
    file = open('info.csv','x')
    file.close()
except:
    print("The file is already there!")

In [2]:
import pandas as pd
df = pd.read_csv('info.csv')
df

   sn   name  age    address        phone
0   1    Ram   34  Kathmandu   9808778765
1   2  Shyam   45  Bhaktapur  98085565443
2   3   Hari   56       Bara   9808667654
3   4   Sita   67      Jhapa   9808556543
4   5   Gita   70    Dhading   9808778765
5   6  Nabin   34    Nuwakot   9808556543

In [11]:
# !pip install pandas
import pandas as pd
df = pd.read_csv('info.csv',nrows = 5)
df
# df.head()
# df.tail()

   sn   name  age    address        phone
0   1    Ram   34  Kathmandu   9808778765
1   2  Shyam   45  Bhaktapur  98085565443
2   3   Hari   56       Bara   9808667654
3   4   Sita   67      Jhapa   9808556543
4   5   Gita   70    Dhading   9808778765

In [12]:
df[0:4]

   sn   name  age    address        phone
0   1    Ram   34  Kathmandu   9808778765
1   2  Shyam   45  Bhaktapur  98085565443
2   3   Hari   56       Bara   9808667654
3   4   Sita   67      Jhapa   9808556543

In [15]:
# iloc
df.iloc[0:4,0:3]

   sn   name  age
0   1    Ram   34
1   2  Shyam   45
2   3   Hari   56
3   4   Sita   67

In [18]:
df

   sn   name  age    address        phone
0   1    Ram   34  Kathmandu   9808778765
1   2  Shyam   45  Bhaktapur  98085565443
2   3   Hari   56       Bara   9808667654
3   4   Sita   67      Jhapa   9808556543
4   5   Gita   70    Dhading   9808778765

In [24]:
import pandas as pd
df = pd.read_csv('info.csv',usecols = ['sn','name','phone'])
df

   sn   name        phone
0   1    Ram   9808778765
1   2  Shyam  98085565443
2   3   Hari   9808667654
3   4   Sita   9808556543
4   5   Gita   9808778765
5   6  Nabin   9808556543

In [27]:
import pandas as pd
df = pd.read_csv('info.csv',)
list(df['name'])

['Ram', 'Shyam', 'Hari', 'Sita', 'Gita', 'Nabin']

In [28]:
import pandas as pd
df = pd.read_csv('info.csv',)
df['name'] == 'Ram'

0     True
1    False
2    False
3    False
4    False
5    False
Name: name, dtype: bool

In [34]:
import pandas as pd
df = pd.read_csv('info.csv',)
df[df['name'] == 'Ram']

   sn name  age    address       phone
0   1  Ram   34  Kathmandu  9808778765
4   5  Ram   70    Dhading  9808778765

In [36]:
import pandas as pd
df = pd.read_csv('info.csv',)
df[(df['name'] == 'Ram') & (df['phone'] ==9808778765 )]

   sn name  age    address       phone
0   1  Ram   34  Kathmandu  9808778765

In [38]:
import pandas as pd
df = pd.read_csv('info.csv',)
data = df[(df['name'] == 'Ram') & (df['phone'] ==9808778765 )]
data.to_csv('info1.csv')

In [ ]:
import pandas as pd
data = {'name':[],'age':[],'add':[]}
n = int(input("Enput n = "))
for i in range(n):
    name = input("Enter name = ")
    age = int(input("Enter age = "))
    add = input("Enter add = ")
    data['name'].append(name)
    data['age'].append(age)
    data['add'].append(add)
print(data)

df = pd.DataFrame(data)
df

In [ ]:
df.to_csv('info3.csv')

In [41]:
import csv
info = []
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    age = int(input("Enter age = "))
    add = input("Enter add = ")
    info.append([name,age,add])
print(info)

# with open('info4.csv','w') as file:
#     x = csv.writer(file)
#     x.writerows(info)
    
file = open('info4.csv','w')
x = csv.writer(file)
x.writerow(['Name','Age','Address'])  #for only one row
x.writerows(info)                     #for multiple rows
file.close()

Enter n = 1
Enter name = Ram
Enter age = 34
Enter add = Kathmandu
[['Ram', 34, 'Kathmandu']]

In [51]:
import csv

with open('info.csv') as csvfile:
    reader = csv.DictReader(csvfile)
    

    for row in reader:
        print(row)

{'sn': '1', 'name': 'Ram', 'age': '34', 'address': 'Kathmandu', 'phone': '9808778765'}
{'sn': '2', 'name': 'Shyam', 'age': '45', 'address': 'Bhaktapur', 'phone': '98085565443'}
{'sn': '3', 'name': 'Hari', 'age': '56', 'address': 'Bara', 'phone': '9808667654'}
{'sn': '4', 'name': 'Sita', 'age': '67', 'address': 'Jhapa', 'phone': '9808556543'}
{'sn': '5', 'name': 'Ram', 'age': '70', 'address': 'Dhading', 'phone': '9808778764'}
{'sn': '6', 'name': 'Nabin', 'age': '34', 'address': 'Nuwakot', 'phone': '9808556543'}

In [55]:
import csv
data = []
with open('info.csv') as csvfile:
    reader = csv.DictReader(csvfile)
    

    for row in reader:
        data.append(row)

data[0]

{'sn': '1',
 'name': 'Ram',
 'age': '34',
 'address': 'Kathmandu',
 'phone': '9808778765'}